In [32]:
import numpy as np
import pandas as pd

# Creating a DataFrame by dictionary

In [33]:
data = {
    'Name' : ['Ravi', 'Amit', 'Raghav', 'Ankit jangir','Jashanpreet singh'],
    'Age' : [23, 24, 22, 25, 21],
    'City' : ['Jaipur', 'ludhiana', 'Delhi', 'Agra', 'Noida'],
    'Salary' : [10000, 15000, 12000, 18000, 20000]
}

df = pd.DataFrame(data = data ,index = ['a', 'b', 'c', 'd', 'e'])
df

                Name  Age      City  Salary
a               Ravi   23    Jaipur   10000
b               Amit   24  ludhiana   15000
c             Raghav   22     Delhi   12000
d       Ankit jangir   25      Agra   18000
e  Jashanpreet singh   21     Noida   20000

# Creating a DataFrame by List

In [34]:
data_list = [['Ravi', 23, 'Jaipur', 10000],
    ['Amit', 24, 'ludhiana', 15000],
    ['Raghav', 22, 'Delhi', 12000],
    ['Ankit jangir', 25, 'Agra', 18000],
    ['Jashanpreet singh', 21, 'Noida', 20000]
]
df2 = pd.DataFrame(data_list, columns=['Name', 'Age', 'City', 'Salary'])
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   22     Delhi   12000
3       Ankit jangir   25      Agra   18000
4  Jashanpreet singh   21     Noida   20000

# Selection and indexing of column in a DataFrame

In [35]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   22     Delhi   12000
3       Ankit jangir   25      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [36]:
# name_df = df2['Name']  # Selecting the 'Name' column   
# name_df  

df_1 = pd.DataFrame(df2[['Name', 'City']]) # Selecting multiple columns
df_1

# df_2 = df2.iloc[0]  # Selecting the first row 
# df_2

                Name      City
0               Ravi    Jaipur
1               Amit  ludhiana
2             Raghav     Delhi
3       Ankit jangir      Agra
4  Jashanpreet singh     Noida

# Creating or Adding a new column in a DataFrame

In [37]:
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   22     Delhi   12000
3       Ankit jangir   25      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [38]:
df2["Designation"] = ['Engineer', 'Doctor', 'Teacher', 'Artist', 'Scientist']  # Creating a new column
df2

                Name  Age      City  Salary Designation
0               Ravi   23    Jaipur   10000    Engineer
1               Amit   24  ludhiana   15000      Doctor
2             Raghav   22     Delhi   12000     Teacher
3       Ankit jangir   25      Agra   18000      Artist
4  Jashanpreet singh   21     Noida   20000   Scientist

# Removing a column from a DataFrame

In [39]:
df2

                Name  Age      City  Salary Designation
0               Ravi   23    Jaipur   10000    Engineer
1               Amit   24  ludhiana   15000      Doctor
2             Raghav   22     Delhi   12000     Teacher
3       Ankit jangir   25      Agra   18000      Artist
4  Jashanpreet singh   21     Noida   20000   Scientist

In [40]:
df2.drop('Designation',axis=1,inplace=True) # inplace=True means that the changes will be applied to the original DataFrame
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   22     Delhi   12000
3       Ankit jangir   25      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [41]:
df2.drop(['City', 'Salary'], axis=1)  # Removing multiple columns
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   22     Delhi   12000
3       Ankit jangir   25      Agra   18000
4  Jashanpreet singh   21     Noida   20000

In [42]:
df2.drop(0,axis=0,)
df2

                Name  Age      City  Salary
0               Ravi   23    Jaipur   10000
1               Amit   24  ludhiana   15000
2             Raghav   22     Delhi   12000
3       Ankit jangir   25      Agra   18000
4  Jashanpreet singh   21     Noida   20000